---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurveOverconstrained
source: html/e83009e5-91d5-49d8-cbdc-c5fbbf45df4a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarShapeFailures.CurveOverconstrained Property

Segment is overconstrained. It has at least one parameterized dimension that conflicts with another dimension.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveOverconstrained { get; }
```